app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "8"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", ""], ["created_at", Sat, 21 Apr 2012 12:45:46 UTC +00:00], ["post_id", 10], ["updated_at", Sat, 21 Apr 2012 12:45:46 UTC +00:00], ["user_id", 1]]