app/controllers/posts_controller.rb

  def index
    @posts = Post.all #la arroba es para mandala a view
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "updated_at", "user") VALUES (?, ?, ?, ?)  [["body", "hola mundo"], ["created_at", Sat, 21 Apr 2012 09:35:24 UTC +00:00], ["updated_at", Sat, 21 Apr 2012 09:35:24 UTC +00:00], ["user", "lukadilauro"]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "user" = 'lukas', "updated_at" = '2012-04-21 09:35:50.409327' WHERE "posts"."id" = 1